protocolli/spcoop/example/client/ValidazioneContenutiWS/files/esitoAggiornamentoUtenteAsincronoSimmetricoWDL.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<esitoAggiornamentoUtenteAsincronoSimmetricoWDLRequest xmlns="http://openspcoop2.org/ValidazioneContenutiWS/Service/types">
<esito>OK</esito>
</esitoAggiornamentoUtenteAsincronoSimmetricoWDLRequest>
</soapenv:Body>
</soapenv:Envelope>
